wyniki/fio_results_btrfs_ssd/lab-sec-13/fio_archive_test_output.txt
archive_test: (g=0): rw=write, bs=(R) 64.0KiB-128KiB, (W) 64.0KiB-128KiB, (T) 64.0KiB-128KiB, ioengine=libaio, iodepth=128
...
fio-3.36
Starting 2 processes
archive_test: Laying out IO file (1 file / 10240MiB)
archive_test: Laying out IO file (1 file / 10240MiB)

archive_test: (groupid=0, jobs=2): err= 0: pid=11467: Tue Dec  3 21:37:05 2024
  write: IOPS=2543, BW=207MiB/s (217MB/s)(20.0GiB/99070msec); 0 zone resets
    slat (usec): min=10, max=859, avg=81.87, stdev=42.46
    clat (msec): min=2, max=982, avg=100.45, stdev=81.16
     lat (msec): min=2, max=982, avg=100.53, stdev=81.16
    clat percentiles (msec):
     |  1.00th=[   43],  5.00th=[   53], 10.00th=[   73], 20.00th=[   78],
     | 30.00th=[   80], 40.00th=[   83], 50.00th=[   85], 60.00th=[   88],
     | 70.00th=[   92], 80.00th=[   96], 90.00th=[  108], 95.00th=[  136],
     | 99.00th=[  418], 99.50th=[  718], 99.90th=[  785], 99.95th=[  969],
     | 99.99th=[  978]
   bw (  KiB/s): min= 7680, max=412288, per=100.00%, avg=213933.77, stdev=33804.41, samples=390
   iops        : min=   84, max= 4918, avg=2570.55, stdev=406.18, samples=390
  lat (msec)   : 4=0.01%, 20=0.01%, 50=3.58%, 100=81.28%, 250=10.72%
  lat (msec)   : 500=3.69%, 750=0.36%, 1000=0.35%
  cpu          : usr=1.72%, sys=9.59%, ctx=35859, majf=0, minf=20
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,251984,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=207MiB/s (217MB/s), 207MiB/s-207MiB/s (217MB/s-217MB/s), io=20.0GiB (21.5GB), run=99070-99070msec